In [6]:
import pandas as pd
data ={
    'name':['basha','suku','nanu'],
    'age':[21,20,21],
    'city':['kovur','penuballi','nlr'],
}

In [7]:
dt = pd.DataFrame(data)

In [8]:
print(dt)

    name  age       city
0  basha   21      kovur
1   suku   20  penuballi
2   nanu   21        nlr

In [9]:
dt.head()

    name  age       city
0  basha   21      kovur
1   suku   20  penuballi
2   nanu   21        nlr

dt[loc(1)]

In [10]:
dt.loc(1)

In [11]:
dt[['age']]

   age
0   21
1   20
2   21

In [12]:
dt[['age','name']]

   age   name
0   21  basha
1   20   suku
2   21   nanu

In [13]:
dt[['name']][dt['age'] > 20]

    name
0  basha
2   nanu

In [14]:
dt['salary'] = [50000, 45000, 48000]  # Example salaries

In [15]:
dt

    name  age       city  salary
0  basha   21      kovur   50000
1   suku   20  penuballi   45000
2   nanu   21        nlr   48000

In [16]:
dt

    name  age       city  salary
0  basha   21      kovur   50000
1   suku   20  penuballi   45000
2   nanu   21        nlr   48000

In [17]:
dt.sort_values(by='age')

    name  age       city  salary
1   suku   20  penuballi   45000
0  basha   21      kovur   50000
2   nanu   21        nlr   48000

In [18]:
dt.groupby('city').agg({'age':'mean','salary':'sum'})

            age  salary
city
kovur      21.0   50000
nlr        21.0   48000
penuballi  20.0   45000

In [19]:
def age_group(age):
    if age>20:
        return "Young"
    else:
        return "Teen"

In [20]:
dt['age'].apply(age_group)

0    Young
1     Teen
2    Young
Name: age, dtype: object

In [21]:
print(dt['age'])

0    21
1    20
2    21
Name: age, dtype: int64

In [22]:
print("Total")

Total